; domain
(define (domain miconic)
  (:requirements :strips)
  (:types passenger - object
          floor - object
         )

(:predicates 
(origin ?person - passenger ?floor - floor)
;; entry of ?person is ?floor
;; inertia

(destin ?person - passenger ?floor - floor)
;; exit of ?person is ?floor
;; inertia

(above ?floor1 - floor  ?floor2 - floor)
;; ?floor2 is located above of ?floor1

(boarded ?person - passenger)
;; true if ?person has boarded the lift

(not-boarded ?person - passenger)
;; true if ?person has not boarded the lift

(served ?person - passenger)
;; true if ?person has alighted as her destination

(not-served ?person - passenger)
;; true if ?person is not at their destination

(lift-at ?floor - floor)
;; current position of the lift is at ?floor
)


;;stop and allow boarding

(:action board
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (origin ?p ?f))
  :effect (boarded ?p))

(:action depart
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (destin ?p ?f)
		     (boarded ?p))
  :effect (and (not (boarded ?p))
	       (served ?p)))
;;drive up

(:action up
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f1 ?f2))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))


;;drive down

(:action down
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f2 ?f1))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))
)

; problem
(define (problem mixed-f5-p27-u0-v0-d0-a0-n0-A0-B0-N0-F0)
   (:domain miconic)
   (:objects p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 
             p10 p11 p12 p13 p14 p15 p16 p17 p18 p19 
             p20 p21 p22 p23 p24 p25 p26 - passenger
             f0 f1 f2 f3 f4 - floor)


(:init
(above f0 f1)
(above f0 f2)
(above f0 f3)
(above f0 f4)

(above f1 f2)
(above f1 f3)
(above f1 f4)

(above f2 f3)
(above f2 f4)

(above f3 f4)



(origin p0 f3)
(destin p0 f0)

(origin p1 f4)
(destin p1 f0)

(origin p2 f1)
(destin p2 f0)

(origin p3 f3)
(destin p3 f1)

(origin p4 f3)
(destin p4 f4)

(origin p5 f0)
(destin p5 f2)

(origin p6 f4)
(destin p6 f3)

(origin p7 f0)
(destin p7 f4)

(origin p8 f0)
(destin p8 f4)

(origin p9 f1)
(destin p9 f4)

(origin p10 f1)
(destin p10 f0)

(origin p11 f4)
(destin p11 f1)

(origin p12 f3)
(destin p12 f1)

(origin p13 f0)
(destin p13 f4)

(origin p14 f3)
(destin p14 f1)

(origin p15 f4)
(destin p15 f1)

(origin p16 f0)
(destin p16 f2)

(origin p17 f3)
(destin p17 f2)

(origin p18 f4)
(destin p18 f2)

(origin p19 f1)
(destin p19 f2)

(origin p20 f2)
(destin p20 f0)

(origin p21 f4)
(destin p21 f1)

(origin p22 f0)
(destin p22 f3)

(origin p23 f3)
(destin p23 f0)

(origin p24 f4)
(destin p24 f3)

(origin p25 f4)
(destin p25 f2)

(origin p26 f3)
(destin p26 f4)






(lift-at f0)
)


(:goal


(and
(served p0)
(served p1)
(served p2)
(served p3)
(served p4)
(served p5)
(served p6)
(served p7)
(served p8)
(served p9)
(served p10)
(served p11)
(served p12)
(served p13)
(served p14)
(served p15)
(served p16)
(served p17)
(served p18)
(served p19)
(served p20)
(served p21)
(served p22)
(served p23)
(served p24)
(served p25)
(served p26)
))
)

; plan
1. (board f0 p5)
   added: (boarded p5)
   goals met: 0 of 27
2. (board f0 p22)
   added: (boarded p22)
   goals met: 0 of 27
3. (board f0 p16)
   added: (boarded p16)
   goals met: 0 of 27
4. (up f0 f4)
   deleted: (lift-at f0)
   added: (lift-at f4)
   goals met: 0 of 27
5. (board f4 p6)
   added: (boarded p6)
   goals met: 0 of 27
6. (board f4 p25)
   added: (boarded p25)
   goals met: 0 of 27
7. (board f4 p24)
   added: (boarded p24)
   goals met: 0 of 27
8. (board f4 p21)
   added: (boarded p21)
   goals met: 0 of 27
9. (board f4 p18)
   added: (boarded p18)
   goals met: 0 of 27
10. (board f4 p15)
   added: (boarded p15)
   goals met: 0 of 27
11. (board f4 p11)
   added: (boarded p11)
   goals met: 0 of 27
12. (board f4 p1)
   added: (boarded p1)
   goals met: 0 of 27
13. (down f4 f3)
   deleted: (lift-at f4)
   added: (lift-at f3)
   goals met: 0 of 27
14. (depart f3 p6)
   deleted: (boarded p6)
   added: (served p6)
   goals met: 1 of 27
15. (depart f3 p24)
   deleted: (boarded p24)
   added: (served p24)
   goals met: 2 of 27
16. (depart f3 p22)
   deleted: (boarded p22)
   added: (served p22)
   goals met: 3 of 27
17. (board f3 p4)
   added: (boarded p4)
   goals met: 3 of 27
18. (board f3 p3)
   added: (boarded p3)
   goals met: 3 of 27
19. (board f3 p26)
   added: (boarded p26)
   goals met: 3 of 27
20. (board f3 p23)
   added: (boarded p23)
   goals met: 3 of 27
21. (board f3 p17)
   added: (boarded p17)
   goals met: 3 of 27
22. (board f3 p14)
   added: (boarded p14)
   goals met: 3 of 27
23. (board f3 p12)
   added: (boarded p12)
   goals met: 3 of 27
24. (board f3 p0)
   added: (boarded p0)
   goals met: 3 of 27
25. (down f3 f1)
   deleted: (lift-at f3)
   added: (lift-at f1)
   goals met: 3 of 27
26. (depart f1 p11)
   deleted: (boarded p11)
   added: (served p11)
   goals met: 4 of 27
27. (board f1 p9)
   added: (boarded p9)
   goals met: 4 of 27
28. (board f1 p2)
   added: (boarded p2)
   goals met: 4 of 27
29. (board f1 p19)
   added: (boarded p19)
   goals met: 4 of 27
30. (board f1 p10)
   added: (boarded p10)
   goals met: 4 of 27
31. (depart f1 p12)
   deleted: (boarded p12)
   added: (served p12)
   goals met: 5 of 27
32. (depart f1 p14)
   deleted: (boarded p14)
   added: (served p14)
   goals met: 6 of 27
33. (depart f1 p15)
   deleted: (boarded p15)
   added: (served p15)
   goals met: 7 of 27
34. (depart f1 p21)
   deleted: (boarded p21)
   added: (served p21)
   goals met: 8 of 27
35. (depart f1 p3)
   deleted: (boarded p3)
   added: (served p3)
   goals met: 9 of 27
36. (up f1 f2)
   deleted: (lift-at f1)
   added: (lift-at f2)
   goals met: 9 of 27
37. (board f2 p20)
   added: (boarded p20)
   goals met: 9 of 27
38. (depart f2 p16)
   deleted: (boarded p16)
   added: (served p16)
   goals met: 10 of 27
39. (depart f2 p17)
   deleted: (boarded p17)
   added: (served p17)
   goals met: 11 of 27
40. (depart f2 p18)
   deleted: (boarded p18)
   added: (served p18)
   goals met: 12 of 27
41. (depart f2 p19)
   deleted: (boarded p19)
   added: (served p19)
   goals met: 13 of 27
42. (depart f2 p25)
   deleted: (boarded p25)
   added: (served p25)
   goals met: 14 of 27
43. (depart f2 p5)
   deleted: (boarded p5)
   added: (served p5)
   goals met: 15 of 27
44. (down f2 f0)
   deleted: (lift-at f2)
   added: (lift-at f0)
   goals met: 15 of 27
45. (board f0 p13)
   added: (boarded p13)
   goals met: 15 of 27
46. (board f0 p7)
   added: (boarded p7)
   goals met: 15 of 27
47. (board f0 p8)
   added: (boarded p8)
   goals met: 15 of 27
48. (depart f0 p0)
   deleted: (boarded p0)
   added: (served p0)
   goals met: 16 of 27
49. (depart f0 p1)
   deleted: (boarded p1)
   added: (served p1)
   goals met: 17 of 27
50. (depart f0 p10)
   deleted: (boarded p10)
   added: (served p10)
   goals met: 18 of 27
51. (depart f0 p2)
   deleted: (boarded p2)
   added: (served p2)
   goals met: 19 of 27
52. (depart f0 p20)
   deleted: (boarded p20)
   added: (served p20)
   goals met: 20 of 27
53. (depart f0 p23)
   deleted: (boarded p23)
   added: (served p23)
   goals met: 21 of 27
54. (up f0 f4)
   deleted: (lift-at f0)
   added: (lift-at f4)
   goals met: 21 of 27
55. (depart f4 p13)
   deleted: (boarded p13)
   added: (served p13)
   goals met: 22 of 27
56. (depart f4 p26)
   deleted: (boarded p26)
   added: (served p26)
   goals met: 23 of 27
57. (depart f4 p4)
   deleted: (boarded p4)
   added: (served p4)
   goals met: 24 of 27
58. (depart f4 p7)
   deleted: (boarded p7)
   added: (served p7)
   goals met: 25 of 27
59. (depart f4 p8)
   deleted: (boarded p8)
   added: (served p8)
   goals met: 26 of 27
60. (depart f4 p9)
   deleted: (boarded p9)
   added: (served p9)
   goals met: 27 of 27
